#+options: toc:nil
#+options: num:nil
*** My first Org-mode file

    * The function ~str()~ prints all variables (column vectors) of a
      data structure.
    * In the code block, ~str()~ is applied to the built-in data frame
      ~mtcars~.
    * The result shows that ~mtcars~ contains 32 rows (observations)
      of 11 variables.
    * The syntax is not highlighted (language keywords like ~str~ and
      data like ~mtcars~ are not visually distinguished).
    * The code block header has the following arguments:

      | HEADER ARGUMENT      | MEANING                                                |
      |----------------------+--------------------------------------------------------|
      | ~:session *R*~       | Run R in a session in the Emacs buffer ~*R*~           |
      | ~:var DATA="mtcars"~ | Assign ~mtcars~ to the variable ~DATA~                 |
      | ~:results output~    | insert output directly in the org file                 |
      | ~:tangle first.R~    | export source code as R file ~first.R~  ("tangle")     |
      | ~:exports both~      | both result and source code will be exported           |
      | ~:comments both~     | link source code and org files, add comments to source |

    #+name: mtcars
    #+begin_src R :session *R* :var DATA="mtcars" :results output :tangle mtcars.R :exports both :comments both
      ## print structure of mtcars data frame
      str(mtcars)
    #+end_src

    #+RESULTS: mtcars
    #+begin_example

    'data.frame':       32 obs. of  11 variables:
     $ mpg : num  21 21 22.8 21.4 18.7 18.1 14.3 24.4 22.8 19.2 ...
     $ cyl : num  6 6 4 6 8 6 8 4 4 6 ...
     $ disp: num  160 160 108 258 360 ...
     $ hp  : num  110 110 93 110 175 105 245 62 95 123 ...
     $ drat: num  3.9 3.9 3.85 3.08 3.15 2.76 3.21 3.69 3.92 3.92 ...
     $ wt  : num  2.62 2.88 2.32 3.21 3.44 ...
     $ qsec: num  16.5 17 18.6 19.4 17 ...
     $ vs  : num  0 0 1 1 0 1 0 1 1 1 ...
     $ am  : num  1 1 1 0 0 0 0 0 0 0 ...
     $ gear: num  4 4 4 3 3 3 3 4 4 4 ...
     $ carb: num  4 4 1 1 2 1 4 2 2 4 ...
    #+end_example

